#include "xlist.h"

int main(void)
{
	int y=0,m=0,yd=0,md=0,d=31,gre=1,dotw=1,i=0;
	char e[9][100]={
	/*0*/"\n=========================Error========================\n",
	/*1*/"\n=========================警告=========================\n",
	/*2*/"このプログラムでは西暦0年や紀元前を定義していません。",
	/*3*/"月の値に不正な値が入力されました。",
	/*4*/"グレゴリオ暦は約2621年に一日ずれると言われています。\n表\示されたカレンダーは参考程度にお考え下さい。",
	/*5*/"\n======================================================\n",
	/*6*/"終了するにはEnterキーを押してください..."};
	printf("カレンダー v1.00\n");
	
	printf("年数入力 >>>");xscanf(&y);
	if(y<1){//1年未満
		printf("%s%s%s%s",e[0],e[2],e[5],e[6]);
		getchar();return -1;}
		
	printf("月入力   >>>");xscanf(&m);
	if(m<1||m>12){//1月未満,12月超
		printf("%s%s%s%s",e[0],e[3],e[5],e[6]);
		getchar();return -1;}
	
	//暦フラグ。0=ユリウス,1=グレゴリオ,2=堺(1582/10)
	if(y<1582){gre=0;}
	else if(y==1582&&m<10){gre=0;}
	else if(y==1582&&m==10){gre=2;}
	
	if(y>=2621){//約2621年に1日ずれる事の警告
		printf("%s%s%s",e[1],e[4],e[5]);}
	
	/**********************************ユリウス暦**********************************/
	if(gre==0||gre==2){//1日の曜日算出
		yd = (y-1)*365 + (y-1)/4;
		md = (m-1)*31;
		if(m>2){md-=3;
			if(y%4==0){md+=1;}}
		if(m>4){md--;}
		if(m>6){md--;}
		if(m>9){md--;}
		if(m>11){md--;}
		dotw=(yd+md+6)%7;
	}
	/******************************************************************************/
	
	
	
	/*********************************グレゴリオ暦*********************************/
	else if(gre==1){//1日の曜日算出
		yd = (y-1)*365 + (y-1)/4 - (y-1)/100 + (y-1)/400;
		md = (m-1)*31;
		if(m>2){md-=3;
			if(y%4==0){md+=1;}
			if(y%100==0){md-=1;}
			if(y%400==0){md+=1;}}
		if(m>4){md--;}
		if(m>6){md--;}
		if(m>9){md--;}
		if(m>11){md--;}
		dotw=(yd+md+8)%7;
	}
	/******************************************************************************/
	switch(gre){
		case 0:
		printf("ユリウス暦を使用しています。\n\n");break;
		case 1:
		printf("グレゴリオ暦を使用しています。\n\n");break;
		case 2:
		printf("ユリウス暦とグレゴリオ暦の境目の月です。\n\n");break;
		default:
		printf("エラーが発生しました。\nエラーコード:G-%d\n\n%s",gre,e[6]);getchar();return 0;
	}
	printf("%4d年  %2d月\n",y,m);
	printf("日 月 火 水 木 金 土\n");
	if(m==4||m==6||m==9||m==11){d--;}//31日の無い月(2月除く)
	if(y%4!=0&&m==2){d=28;}//2月平年
	if(y%4==0&&m==2){d=29;}//2月閏年
	if(gre==1&&y%100==0&&y%400!=0&&m==2){d=28;}//グレゴリオ暦100年毎平年(400年毎除く)
	
	for(i=dotw;i>0;i--){//最初の曜日まで空白出力
			printf("   ");}
	
	for(i=1;i<=d;i++){//カレンダー日付出力
		if(y==1582&&m==10&&i==5){i+=10;dotw+=4;}//暦改定時の日付と曜日を飛ばす。
		printf("%2d",i);
		if((i+dotw)%7==0){printf("\n");}//土曜の次に改行
		else{printf(" ");}//他の曜日の次は空白
	}
	if((d+dotw)%7!=0){printf("\n");}//最後が土曜でないなら改行
	printf("\n%s",e[6]);
	getchar();return 0;}